print("Списки:")
import random
mg = ["Иванов", "Петров", "Сидоров", "Николаев", "Александров",
     "Алексеев", "Борисов", "Олегов", "Волков", "Юрин"]
og = ["Павлов", "Соловьев", "Григорьев", "Душилин", "Ласточкин",
      "Твдввлд", "Цввшлв", "Жовоов", "Ллвлв", "Рьволв"]
t1 = random.sample(mg, 5)
t2 = random.sample(og, 5)
team = tuple(sorted(t1 + t2))
length = len(team)
count = team.count("Иванов")
if count == 0:
    print(mg, "\n", og, "\n", team, "\n", length, "\n", "Студент Иванов в команду не входит")
else:
    print(mg, "\n", og, "\n", team, "\n", length, "\n", "Студент Иванов состоит в команде", count, "раз(а)")